# Pandas Tutorial Day 8

In [11]:
import pandas as pd

india_weather = pd.DataFrame({
    'city' : ['mumbai', 'delhi', 'bangalore'],
    'temperatur' : [32, 45, 30],
    'humidity' : [80, 60, 78]
}, index = [0,1,2])

us_weather = pd.DataFrame({
    'city' : ['new york', 'chicago', 'orlando'],
    'temperatur' : [21, 14, 35],
    'humidity' : [68, 65, 75]
})

us_weather

       city  temperatur  humidity
0  new york          21        68
1   chicago          14        65
2   orlando          35        75

Now we want to concatenate both the dataframes

In [12]:
df = pd.concat([india_weather, us_weather], ignore_index = True)
df

        city  temperatur  humidity
0     mumbai          32        80
1      delhi          45        60
2  bangalore          30        78
3   new york          21        68
4    chicago          14        65
5    orlando          35        75

We can also provide keys while defining the datafram so that the we can retrieve data for particular country

In [13]:
df = pd.concat([india_weather, us_weather], keys = ['india', 'us'])
df.loc['us']

       city  temperatur  humidity
0  new york          21        68
1   chicago          14        65
2   orlando          35        75

Now suppose we have another dataframe that we would like to have as a column in our dataframe

In [14]:
# creating the additional dataframe
india_wind = pd.DataFrame({
    'city' : ['mumbai', 'delhi', 'bangalore'],
    'wind' : [42, 20, 3]
})

df_ind = pd.concat([india_weather, india_wind], axis = 1)
df_ind

        city  temperatur  humidity       city  wind
0     mumbai          32        80     mumbai    42
1      delhi          45        60      delhi    20
2  bangalore          30        78  bangalore     3

Now the order of the cities could be different and some of the entries might be missing as well, we need to handle those cases

In [19]:
# creating the additional dataframe with missing values and out of order
india_wind = pd.DataFrame({
    'city' : ['delhi', 'mumbai'],
    'wind' : [42, 3]
}, index = [1, 0])

df_ind = pd.concat([india_weather, india_wind], axis = 1)
df_ind

        city  temperatur  humidity    city  wind
0     mumbai          32        80  mumbai   3.0
1      delhi          45        60   delhi  42.0
2  bangalore          30        78     NaN   NaN

In [21]:
# next we'll see how to join dataframe with a series
india_weather = pd.DataFrame({
    'city' : ['mumbai', 'delhi', 'bangalore'],
    'temperatur' : [32, 45, 30],
    'humidity' : [80, 60, 78]
}, index = [0,1,2])

ser = pd.Series(['Humid', 'Sunny', 'Rain'], name='Event')

df = pd.concat([india_weather, ser], axis = 1)
df

        city  temperatur  humidity  Event
0     mumbai          32        80  Humid
1      delhi          45        60  Sunny
2  bangalore          30        78   Rain